cridp/iown-homecontrol-esp32sx1276/src/iohcRadio.cpp
        BaseType_t task_code = xTaskCreatePinnedToCore(handle_interrupt_task, "handle_interrupt_task", 8192,
                                                       this, 4,
                                                       &handle_interrupt, xPortGetCoreID());
        if (task_code != pdPASS) {
            ets_printf("ERROR STATEMACHINE Can't create task %d\n", task_code);
            return;
        }
    }

    /**
     * @brief Returns a pointer to a single instance of the `iohcRadio`
     * class, creating it if it doesn't already exist.
     *
     * @return An instance of the `iohcRadio` class.
     */
    iohcRadio *iohcRadio::getInstance() {
        if (!_iohcRadio)
            _iohcRadio = new iohcRadio();
        return _iohcRadio;
    }

    /**
     * Initializes the radio with specified parameters and sets it to receive mode.
     *
     * @param num_freqs Number of
     * frequencies to scan. It is of type `uint8_t`. This
     * parameter specifies how many frequencies the radio will scan during operation.
     * @param scan_freqs array of `uint32_t` values that represent the
     * frequencies to be scanned during the radio operation. The `start` function initializes the radio
     * with the provided frequencies for scanning.
     * @param scanTimeUs time interval in microseconds for scanning frequencies. If a specific value is
     * provided for `scanTimeUs`, it will be used as the scan interval. Otherwise, the default scan
     * interval defined as
     * @param rxCallback The `rxCallback` is a delegate or
     * function pointer that will be called when a packet is received by the radio. It is set to `nullptr`
     * by default if not provided during the function call.
     * @param txCallback The `txCallback` is a callback function that will be called when a packet is
     * transmitted by the radio. This callback function can be provided by the user
     */
    void iohcRadio::start(uint8_t num_freqs, uint32_t *scan_freqs, uint32_t scanTimeUs,
                          CallbackFunction rxCallback = nullptr, CallbackFunction txCallback = nullptr) {
        this->num_freqs = num_freqs;
        this->scan_freqs = scan_freqs;
        // this->scanTimeUs = scanTimeUs ? scanTimeUs : DEFAULT_SCAN_INTERVAL_US;
        this->rxCB = std::move(rxCallback);
        this->txCB = std::move(txCallback);
        this->currentFreqIdx = 0;
        this->expectingResponse = false;

        // CONFIGURATION PAR DÉFAUT RECOMMANDÉE
        if (scanTimeUs == 0) {
            // Démarrer en mode fast scan
            this->scanTimeUs = 23 * 1000; // 15ms par fréquence
            // ESP_LOGI("FHSS", "Using default adaptive FHSS: 15ms fast scan");
        } else {
            this->scanTimeUs = scanTimeUs;
        }

        Radio::clearBuffer();
        Radio::clearFlags();

        /* We always start at freq[0], the 1W/2W channel*/
        Radio::setCarrier(Radio::Carrier::Frequency, scan_freqs[0]); // CHANNEL2); // 868950000);

        if (this->num_freqs > 1) {
            this->currentFreqIdx = 0;

            // start adaptative
            adaptiveFHSS = new AdaptiveFHSS(this);

            // Start Frequency Hopping Timer
            ets_printf("Starting FHSSTimer Handler...\n");
            adaptiveFHSS->switchToFastScan();
        }
        Radio::setRx();
    }

    /**
     * Handles various radio operations based on different conditions
     * and configurations for SX127X
     *
     * @param radio Pointer to an
     * instance of the `iohcRadio` class. This pointer is used to access and modify the properties and
     * methods of the `iohcRadio` object within the function.
     *
     * Ne rien faire dans l'ISR qui puisse allouer, prendre mutex/sem, ou appeler des fonctions non-ISR-safe.
     * Faire en sorte que tickerCounter() ne fasse que le minimum : lire les IRQ, mettre à jour lastActivityTime, écrire un flag / envoyer une notification vers une task (via xTaskNotifyFromISR() ou xQueueSendFromISR()), et retourner.
     * Tout le traitement (lecture FIFO, allocation, vector insert) doit être fait dans une task FreeRTOS.
     */

    void IRAM_ATTR iohcRadio::tickerCounter(iohcRadio *radio) {
        Radio::readBytes(REG_IRQFLAGS1, _flags, sizeof(_flags));

        if (radioState == iohcRadio::RadioState::PREAMBLE) {
            // Préambule détecté, déjà verrouillé dans l'ISR
        } else if (radioState == iohcRadio::RadioState::PAYLOAD) {
            // if TX ready?
            if (_flags[0] & RF_IRQFLAGS1_TXREADY) {
                radio->sent(radio->new_packet);
                Radio::clearFlags();
                if (radioState != iohcRadio::RadioState::TX) {
                    Radio::setRx();
                    radio->setRadioState(iohcRadio::RadioState::RX);

                    // Only when no response expected
                    if (/*!radio->expectingResponse &&*/ !txMode) {
                        radio->unlockFHSS(FHSSLockReason::TRANSMITTING);
                    }
                }
                return;
            }
            // Réception de payload
            // maybeCheckHeap("BEFORE RECEIVE IN TICKERCOUNTER");
            radio->receive(false);
            // maybeCheckHeap("AFTER RECEIVE IN TICKERCOUNTER");
            Radio::clearFlags();

            // radio->tickCounter = 0;
            // Après réception, Only when no response expected

            // if (!radio->expectingResponse) {
            // Petit délai avant de déverrouiller pour laisser le temps de traiter
            // et éventuellement envoyer une réponse
            // vTaskDelay(pdMS_TO_TICKS(50));
            // radio->forceUnlockFHSS();
            // }
        }

    }
    /**
         * Crée un wrapper de paquet de manière SÉCURISÉE
         * Retourne nullptr si allocation échoue (au lieu de crasher)
         */
    static TxPacketWrapper* IRAM_ATTR createPacketWrapper(iohcPacket* sourcePacket) {
        if (!sourcePacket) {
            // ets_printf("createPacketWrapper: sourcePacket is null\n");
            return nullptr;
        }

        // Essayer d'allouer d'abord la copie du paquet
        iohcPacket* pktToSend = nullptr;

        pktToSend = new (std::nothrow) iohcPacket(*sourcePacket);
        if (!pktToSend) {
            // ets_printf("createPacketWrapper: Failed to allocate packet copy\n");
            return nullptr;  // Fuite zéro - rien n'a été alloué
        }

        // Ensuite allouer le wrapper
        auto wrapper = new (std::nothrow) TxPacketWrapper(pktToSend);
        if (!wrapper) {
            // ets_printf("createPacketWrapper: Failed to allocate wrapper\n");
            // Libérer le paquet
            delete pktToSend;
            return nullptr;  // Fuite zéro
        }

        return wrapper;
    }
    /**
 * Sends packets stored in a vector with a specified repeat time.
 *
 * @param TxPackets `Vector of pointers to `iohcPacket` objects.
*
 * Envoie un ou plusieurs paquets
 * Les paquets sont COPIÉS en interne, on garde la propriété des originaux
 */
    bool iohcRadio::send(std::vector<iohcPacket *> &TxPackets) {
        if (TxPackets.empty()) {
            ets_printf("Send called with empty packet list");
            return false;
        }
        if (xSemaphoreTake(txQueue_binary_sem, pdMS_TO_TICKS(100)) != pdTRUE) {
            return false;
        }

        txCounter = 0;
        // Ajouter chaque paquet à la queue (en faisant une COPIE)
        for (auto *pkt: TxPackets) {
            if (pkt) {
                // Utiliser la factory
                if (TxPacketWrapper* wrapper = createPacketWrapper(pkt)) {
                    txQueue.push_back(wrapper);
                    pkt = nullptr; // Transfer ownership
                }
            }
        }
        TxPackets.clear();

        startTransmission();
        xSemaphoreGive(txQueue_binary_sem);
        return true;

